const expect = require('expect.js');
const {
    getId,
    dateDifference,
    getMaxSumId
} = require('../logic.js');

describe('Алгоритм для нахождения злостного читателя', () => {
    it('должен выдавать id, на вход подаётся многомерный массив', () => {
      expect(
        getId(
            [5,3,5,5,1,3,1,4,2,2],
            ['2018-01-30','2018-02-10','2018-02-28','2018-03-03','2018-06-11','2018-06-21','2018-07-05','2018-08-07','2018-08-09','2018-08-26'],
            ['2018-02-04','2018-03-04','2018-03-25','2018-03-23','2018-06-19','2018-06-28','2018-07-09','2018-08-14','2018-08-16','2018-12-31']
            )
      ).to.eql({
        studId: 2
      });

      expect(
        getId(
            [1,2,3,4],
            ['2018-01-30','2018-02-10','2018-02-28','2018-03-03'],
            ['2018-02-04', ,'2018-03-25', ]
            )
      ).to.eql({
        studId: 2
      });
    });
});